
&НаКлиенте
Процедура ShowBoards(Команда)
	ShowBoardsНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ShowMembers(Команда)
	ShowMembersНаСервере();
КонецПроцедуры

&НаСервере
Процедура ShowMembersНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/organizations/arbistest/members?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить() + "&name=" + ИмяДоски;
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	СписокМембер = "Member - id" + Символы.ПС + Символы.ПС;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчастникиТрелло.ИмяУчастника,
	|	УчастникиТрелло.ID
	|ИЗ
	|	РегистрСведений.УчастникиТрелло КАК УчастникиТрелло";
	Для Каждого Member Из ПакетСообщения Цикл
		ЗаписьЧек = Ложь;
		СписокМембер = СписокМембер + Member.fullName + " - " + Member.id + Символы.ПС;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИмяУчастника = Member.fullName Тогда
				ЗаписьЧек = Ложь;
				Прервать;
			КонецЕсли;
			ЗаписьЧек = Истина;
		КонецЦикла;
		Если ЗаписьЧек Тогда
			Запись = РегистрыСведений.УчастникиТрелло.СоздатьМенеджерЗаписи();
			Запись.ИмяУчастника = Member.fullName;
			Запись.ID = Member.id;
			Запись.Записать();
			Сообщить("Добавлен пользователь " + Member.fullName);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого Member Из ПакетСообщения Цикл
			Если Выборка.ИмяУчастника = Member.fullName Тогда
				УдалитьЧек  = Ложь;
				Прервать;
			КонецЕсли;
			УдалитьЧек = Истина;
		КонецЦикла;
		Если УдалитьЧек Тогда
			Запись = РегистрыСведений.УчастникиТрелло.СоздатьМенеджерЗаписи();
			Запись.ИмяУчастника = Выборка.ИмяУчастника;
			Запись.ID = Выборка.ID;
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	Вывод = СписокМембер;
КонецПроцедуры


&НаКлиенте
Процедура DeleteBoard(Команда)
	DeleteBoardНаСервере();
КонецПроцедуры

&НаСервере
Процедура DeleteBoardНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/boards/" + BoardID + "?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить() + "&name=" + ИмяДоски;
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("DELETE", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	Сообщить("Успешно удалена доска " + ИмяДоски);
КонецПроцедуры


&НаКлиенте
Процедура AddBoard(Команда)
	AddBoardНаСервере();
КонецПроцедуры

&НаСервере
Процедура AddBoardНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить() + "&name=" + ИмяДоски;
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	Сообщить("Успешно добавлена доска " + ИмяДоски);
КонецПроцедуры


&НаСервере
Процедура ShowBoardsНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/members/me/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить();
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	ТаблицаДосок = "Доска - id" + Символы.ПС + Символы.ПС;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоскиТрелло.ИмяДоски,
	|	ДоскиТрелло.ID
	|ИЗ
	|	РегистрСведений.ДоскиТрелло КАК ДоскиТрелло";
	Для Каждого Board Из ПакетСообщения Цикл
		ЗаписьЧек = Ложь;
		ТаблицаДосок = ТаблицаДосок + Board.name + " - " + Board.id + Символы.ПС;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИмяДоски = Board.name Тогда
				ЗаписьЧек = Ложь;
				Прервать;
			КонецЕсли;
			ЗаписьЧек = Истина;
		КонецЦикла;
		Если ЗаписьЧек Тогда
			Запись = РегистрыСведений.ДоскиТрелло.СоздатьМенеджерЗаписи();
			Запись.ИмяДоски = Board.name;
			Запись.ID = Board.id;
			Запись.Записать();
			Сообщить("Добавлена доска " + Board.name);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого Board Из ПакетСообщения Цикл
			Если Выборка.ИмяДоски = board.name Тогда
				УдалитьЧек  = Ложь;
				Прервать;
			КонецЕсли;
			УдалитьЧек = Истина;
		КонецЦикла;
		Если УдалитьЧек Тогда
			Запись = РегистрыСведений.ДоскиТрелло.СоздатьМенеджерЗаписи();
			Запись.ИмяДоски = Выборка.ИмяДоски;
			Запись.ID = Выборка.ID;
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	Вывод = ТаблицаДосок;
КонецПроцедуры

&НаКлиенте
Процедура Assign(Команда)
	AssignНаСервере();
КонецПроцедуры

&НаСервере
Процедура AssignНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/boards/" + BoardID + "/members/" + MemberID + "?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить() + "&type=normal";
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("PUT", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	Сообщить("Успешно назначен на доску");
КонецПроцедуры
















