
&НаКлиенте
Процедура ShowBoards(Команда)
	ShowBoardsНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура AddBoard(Команда)
	AddBoardНаСервере();
КонецПроцедуры

&НаСервере
Процедура AddBoardНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить() + "&name=" + ИмяДоски;
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	Сообщить("Успешно добавлена доска " + ИмяДоски);
КонецПроцедуры


&НаСервере
Процедура ShowBoardsНаСервере()
	JSONЗапрос = Новый ЗаписьJSON;
	JSONЗапрос.УстановитьСтроку();
	//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
	//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
	ЗаголовокЗапросаHTTP = Новый Соответствие;
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	АдресРесурса = "/1/members/me/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить();
	Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
	РезультатЗапроса = Соединение.ВызватьHTTPМетод("GET", Запрос);
	Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
	ПакетСообщения = main.Разобратьпакет(Ответ);
	Сообщить(ПакетСообщения[0].name);
КонецПроцедуры
